/***************************************************************************************************
Описание: Файл для управления скоростью двигателя на основе ПИД-регулятора
Разработчик: Хомутов Евгений
Заметки:
***************************************************************************************************/
#include "motor_regulator.h"   
#include <stdlib.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <stm32f10x_tim.h>


/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/
#define MAX_VALUE_PI 1000
#define MAX_VALUE_PID 4000

/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/

/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/
// Коэффициенты усиления ПИД-регулятора
volatile float pidP = 0.5;
volatile float pidI = 0.15;
volatile float pidD = 0.0;

static int32_t prevErrPID = 0;
static int32_t pidIntTerm = 0;

// Коэффициенты усиления ПИ-регулятора
volatile float piP = 0.5;
volatile float piI = 0.0;
static int32_t piIntTermD = 0;
static int32_t piIntTermQ = 0;


/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/***************************************************************************************************
Описание: ПИД-регулятор
Аргументы: err - ошибка управления
Возврат: Величина управляющего сигнала
Замечания: 
***************************************************************************************************/
int32_t pid_regulator( int32_t err )
{
    int32_t output;
    pidIntTerm += pidI * err;
    output = pidP * err;
    output += pidIntTerm;
    output += pidD * (err - prevErrPID);

    prevErrPID = err;

    return output;
}

/***************************************************************************************************
Описание: ПИ-регулятор тока по оси d
Аргументы: err - ошибка управления
Возврат: Величина управляющего сигнала
Замечания: 
***************************************************************************************************/
int32_t pi_regulator_axis_d( int32_t err )
{
    int32_t output;
    piIntTermD += piI * err;
    output = piP * err;
    output += piIntTermD;

    return output;
}

/***************************************************************************************************
Описание: ПИ-регулятор тока по оси q
Аргументы: err - ошибка управления
Возврат: Величина управляющего сигнала
Замечания: 
***************************************************************************************************/
int32_t pi_regulator_axis_q( int32_t err )
{
    int32_t output;
    piIntTermQ += piI * err;
    output = piP * err;
    output += piIntTermQ;

    return output;
}
