/***************************************************************************************************
Описание: Дифференцирование угла с датчика положения ротора с помощью SysTick
Разработчик: Хомутов Евгений
Заметки:
***************************************************************************************************/
#include <stm32f10x_gpio.h>
#include <stm32f10x_rcc.h>
#include <misc.h>
#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include "motor_speed.h"

/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/

/**************************************************************************************************
Систик совершает прерывания с частотой 72МГц/SYSTICK_PRESCALER, для того чтоб прерывания выполнялись 
каждую 1мс SYSTICK_PRESCALER = 72МГц/72кГц = 1000.
***************************************************************************************************/
#define SYSTICK_PRESCALER 1000 
#define DELAY 10

/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/
 
/***************************************************************************************************
Прототипы локальных функций
***************************************************************************************************/

/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/
volatile uint32_t timeStampMs = 0;

/***************************************************************************************************
Прототипы локальных функций
***************************************************************************************************/

void systickStart( void );
void systickStop( void );
bool delayMs(uint32_t delay);

/***************************************************************************************************
Описание: Временная задержка по SysTick
Аргументы: delay - время задержки в мс
Возврат: true - прошло заданное время, false - нет
Замечания: 
***************************************************************************************************/
bool delayMs(uint32_t delay)
{                                                                                  
    
    if ( timeStampMs < delay )
    {
        return false;
    }
    else
    {
        timeStampMs = 0;
        return true;
    }
}

  /*************************************************************************************************
Описание: Остановка таймера SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/
void systickStop( void )
{
    SysTick->CTRL &= ~SysTick_CTRL_ENABLE;
}

/***************************************************************************************************
Описание: Запуск таймера SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/
void systickStart( void )
{
    SysTick->CTRL |= SysTick_CTRL_ENABLE;
}

/***************************************************************************************************
Описание: Чтение значения с датчика положения ротора двигателя
Аргументы: Нет
Возврат:   Значение от 0 до 1024
Замечания: Значение с датчика положения считывается в TIM2->CNT
***************************************************************************************************/
uint16_t motor_position_getPosition( void )
{
    return TIM2->CNT;
}

/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/***************************************************************************************************
Описание: Получение значения скорости двигателя
Аргументы: Нет
Возврат:   Значение скорости двигателя
Замечания: 
***************************************************************************************************/
int32_t motor_speed_getSpeed( int32_t tempPosition )
{   
    static uint16_t prevPosition = 0;
    int32_t motorSpeed = 0;
 
    // *SYSTICK_PRESCALER - т.к. timeStampMs в мс, полож/сек
    motorSpeed = SYSTICK_PRESCALER / timeStampMs * (tempPosition - prevPosition);
    prevPosition = tempPosition;
    timeStampMs = 0;
    
    motorSpeed /= 1024;  // Нормируем к об/сек
    motorSpeed *= 360; // Нормируем скорость в градусы/сек

    return motorSpeed;
}

/***************************************************************************************************
Описание: Инициализация SysTick
Аргументы: Нет
Возврат:   Нет
Замечания: Смотреть описание SYSTICK_PRESCALER
***************************************************************************************************/
void systick_init ( void )
{     
    SysTick_Config( SystemCoreClock/SYSTICK_PRESCALER ); 
}

/***************************************************************************************************
Описание: Прерывания по Systick
Аргументы: Нет
Возврат:   Нет
Замечания: 
***************************************************************************************************/
void SysTick_Handler()
{
    timeStampMs++;
}
