/*******************************************************************************************************
Описание: Файл для работы с USART1: PB6-Tx, PB7-Rx
Разработчик: Хомутов Евгений
Заметки: Инициализация и настройка 8 канала ADC1
*******************************************************************************************************/
#include "usart.h"
#include "project_config.h"
#include <string.h>


/***************************************************************************************************
Локальные дефайны
***************************************************************************************************/

#define ADC_IRQ_HANDLER ADC1_2_IRQHandler
#define BAUDRATE 9600

/***************************************************************************************************
Локальные типы данных
***************************************************************************************************/

typedef void ( *RccClockCmd )( uint32_t, FunctionalState );

/***************************************************************************************************
Локальные переменные файла
***************************************************************************************************/

GPIO_TypeDef * const usart_port = GPIOB;
const uint16_t usart_pin_rx = GPIO_Pin_0; // Первый пин

volatile uint16_t ADC_buffer;   // Массив (буфер) показаний, считывающихся с ADC

/***************************************************************************************************
Глобальные функции
***************************************************************************************************/

/**************************************************************************************************
Описание: Инициализация usart 
Аргументы: Нет
Возврат:   Нет
Замечания: Для чтения значений с потенциометра
**************************************************************************************************/
void usart_init( void )
{
    
    // тактирование пинов USART
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_USART1, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB, ENABLE);
    RCC_APB2PeriphClockCmd (RCC_APB2Periph_AFIO, ENABLE);
    
    GPIO_InitTypeDef port;
    USART_InitTypeDef usart;
    
    // инициализация пинов usart
    //Пин PB6-Rx-inFloating и PB7–Tx-AF_PP
    //Rx и Tx USART’а
    
    port.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    port.GPIO_Pin = GPIO_Pin_6;
    port.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOB, &port);
    
    GPIO_StructInit(&port);
    port.GPIO_Mode = GPIO_Mode_AF_PP;
    port.GPIO_Pin = GPIO_Pin_7;
    port.GPIO_Speed = GPIO_Speed_2MHz;
    GPIO_Init(GPIOB, &port);
    
    GPIO_PinRemapConfig(GPIO_Remap_USART1, ENABLE);
    
    //Настройка USART, все поля оставляем дефолтными, кроме скорости обмена
    USART_StructInit(&usart);
    usart.USART_BaudRate = BAUDRATE;
    USART_Init(USART1, &usart);
 }
